app/views/admin/index.html.erb

<%= t('.it')%><%= Time.now %>
<%= t('.we')%> <%= pluralize(@total_orders,t('.order'))%>
---
SELECT COUNT(*) FROM "orders"