app/views/favourites/index.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 8 ORDER BY title LIMIT 1
---
<% @favourites.each do |favourite| %>
  <% @product = Product.find(favourite.product_id)%>