app/views/favourites/show.html.erb

  <b>User:</b>
 <% @user = User.find(@favourite.user_id)%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1


<% @product = Product.find(@favourite.product_id)%>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 8 ORDER BY title LIMIT 1