app/views/orders/_form.html.erb

    <div id="error_explanation">
    	<%= t('error.template.header', :count => @order.errors.size,
    	    :model => t('activerecord.models.order'))%>
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 203 LIMIT 1