app/views/orders/index_record.html.erb

<% @orders.each do |order| %>
  <% if @user.name == order.user_name && order.orderstatus == 0%>
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_name" = 'qinjinghui' LIMIT 1