app/views/orders/ordersrecord.html.erb

    <td><%= order.pay_type %></td>
    <td><% if order.orderstatus == 0%>
---
SELECT "orders".* FROM "orders"