app/controllers/carts_controller.rb

INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-21 01:29:58.000000', '2011-07-21 01:29:58.000000')
---
  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save