app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY created_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments"
---
  def index
    @comments = Comment.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>10

INSERT INTO "comments" ("user_id", "created_at", "description", "updated_at", "product_id") VALUES (25, '2011-08-11 03:12:44.515625', '111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111', '2011-08-11 03:12:44.515625', 8)
---
  def create
    @comment = Comment.new(params[:comment])
    if session[:user_id] == nil
      redirect_to login_url
    end
    @comment.product_id = params[:id]
    @comment.user_id = session[:user_id]

    # respond_to do |format|
      # if @comment.save
        # format.html { redirect_to(@comment, :notice => 'Comment was successfully created.') }
        # format.xml  { render :xml => @comment, :status => :created, :location => @comment }
      # else
        # format.html { render :action => "new" }
        # format.xml  { render :xml => @comment.errors, :status => :unprocessable_entity }
      # end
    # end
    @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = 34 LIMIT 1
UPDATE "comments" SET "updated_at" = '2011-08-11 04:57:03.312500', "description" = '111111111111111111111111111111111111111
---
  def update
    @comment = Comment.find(params[:id])

    respond_to do |format|
      if @comment.update_attributes(params[:comment])