app/controllers/favourites_controller.rb

  def index
    @favourites = Favourite.paginate :page => params[:page],:order => 'created_at desc',:per_page=>10,:conditions => "user_id = #{session[:user_id]}"
---
SELECT "favourites".* FROM "favourites" WHERE (user_id = 26) ORDER BY created_at desc LIMIT 10 OFFSET 0

  def show
    @favourite = Favourite.find(params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = 1 LIMIT 1

  def edit
    @favourite = Favourite.find(params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = 1 LIMIT 1

  def create
     @temp = Favourite.count(:conditions => ["product_id = ? and user_id = ?",params[:id],session[:user_id]])
    if @temp != 0
      redirect_to favourites_url
      return
    end
    @favourite = Favourite.new
    @favourite.product_id = params[:id]
    @favourite.user_id = session[:user_id]
    @favourite.save
---
SELECT "favourites".* FROM "favourites" WHERE (product_id = '8' and user_id = 25)
SELECT COUNT(*) FROM "favourites" WHERE (product_id = '9' and user_id = 28)
INSERT INTO "favourites" ("user_id", "created_at", "updated_at", "product_id") VALUES (NULL, '2011-08-11 07:44:53.484375', '2011-08-11 07:44:53.484375', NULL)

  def update
    @favourite = Favourite.find(params[:id])
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = 980190962 LIMIT 1

  def destroy
    @favourite = Favourite.find(params[:id])
    @favourite.destroy
---
SELECT "favourites".* FROM "favourites" WHERE "favourites"."id" = 3 LIMIT 1
DELETE FROM "favourites" WHERE "favourites"."id" = 3