app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-19 05:37:39.523902', '2011-07-19 05:37:39.523902')
INSERT INTO "line_items" ("updated_at", "quantity", "order_id", "cart_id", "created_at", "product_id") VALUES ('2011-07-29 03:48:54.734375', 1, NULL, 980190963, '2011-07-29 03:48:54.734375', 207281424)
UPDATE "line_items" SET "updated_at" = '2011-07-19 07:35:45.490196', "quantity" = 3 WHERE "line_items"."id" = 3
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save