app/controllers/messages_controller.rb

  def index
    @messages = Message.all
    if(session[:user_id])
      @user = User.find(session[:user_id])
---
SELECT "messages".* FROM "messages"
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1

  def show
    @message = Message.find(params[:id])
    if(session[:user_id])
      @user = User.find(session[:user_id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1

  def create
    @message = Message.new(params[:message])
    @user = User.find(session[:user_id])
    @message.author = @user.name
    respond_to do |format|
      if @message.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1
INSERT INTO "messages" ("description", "title", "updated_at", "created_at", "author") VALUES ('1111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111', '234', '2011-08-09 07:03:29.234375', '2011-08-09 07:03:29.234375', 'qinjinghui')

  def update
    @message = Message.find(params[:id])

    respond_to do |format|
      if @message.update_attributes(params[:message])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
UPDATE "messages" SET "updated_at" = '2011-08-09 06:53:42.250000', "description" = '121111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111111' WHERE "messages"."id" = 1

  def destroy
    @message = Message.find(params[:id])
    @message.destroy
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 4 LIMIT 1
DELETE FROM "messages" WHERE "messages"."id" = 4