app/controllers/orders_controller.rb

  def index
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>10,:conditions => "orderstatus=0"
---
SELECT "orders".* FROM "orders" WHERE (orderstatus=0) ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders"

  def index_record
    @user = User.find(session[:user_id])
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>2,:conditions => ["user_name = ? and orderstatus = ?",@user.name,0]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1
SELECT "orders".* FROM "orders" WHERE (user_name = 'daiyuqiang' and orderstatus = 0) ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (user_name='daiyuqiang')

  def ordersrecord
     @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>10,:conditions => "orderstatus<>0"
---
SELECT "orders".* FROM "orders" WHERE (orderstatus<>0) ORDER BY created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (orderstatus<>0)

  def userorderrecord
     @user = User.find(session[:user_id])
     @orders = Order.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>2,:conditions => ["user_name = ? and orderstatus <>?",@user.name,0]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 26 LIMIT 1
SELECT "orders".* FROM "orders" WHERE (user_name = 'daiyuqiang' and orderstatus <>0) ORDER BY created_at desc LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "orders" WHERE (user_name = 'daiyuqiang' and orderstatus <>0)

  def show
    @user = User.find(session[:user_id])
    @order = Order.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 202 LIMIT 1

  def sendorder
    @user = User.find(session[:user_id])
    @order = Order.find(params[:id])
    @order.orderstatus = 1
    for lineItem in @order.line_items
      @product = Product.find(lineItem.product_id)
      @product.inventory -= lineItem.quantity
      @product.sales += lineItem.quantity
      @product.save
    end
    if @order.save
      Notifier.order_shipped(@order).deliver
---
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 215 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 7 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-11 16:53:14.046875', "sales" = 1, "inventory" = 4 WHERE "products"."id" = 8
UPDATE "orders" SET "updated_at" = '2011-08-10 01:06:47.562500', "orderstatus" = 1 WHERE "orders"."id" = 219
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 224)

  def cancelorder
    @user = User.find(session[:user_id])
    @order = Order.find(params[:id])
    @order.orderstatus = 2
    if @order.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 25 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 220 LIMIT 1
UPDATE "orders" SET "updated_at" = '2011-08-10 02:31:29.765625', "orderstatus" = 2 WHERE "orders"."id" = 225

  def new
    if current_cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE ("line_items".cart_id = 19)

  def edit
    @user = User.find(session[:user_id])
    @order = Order.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 203 LIMIT 1

  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    @user = User.find(session[:user_id])
   # @order.user_name = @user.get_username(session[:user_id])
    #@order.user_name = @user.name
    @order.user_name = @user.get_username
    @order.orderstatus = 0

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "line_items".* FROM "line_items" WHERE ("line_items".order_id = 980190963)
INSERT INTO "carts" ("updated_at", "created_at") VALUES ('2011-07-28 09:19:15.217757', '2011-07-28 09:19:15.217757')
INSERT INTO "orders" ("created_at", "email", "orderstatus", "pay_type", "address", "name", "user_name", "updated_at") VALUES ('2011-08-16 09:14:20.968750', 'daimeizi@163.com', 0, 'Check', 'zhongshandaxue', 'daimeizi', 'daimeizi', '2011-08-16 09:14:20.968750')
DELETE FROM "carts" WHERE "carts"."id" = 19

  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 212 LIMIT 1
UPDATE "orders" SET "updated_at" = '2011-08-09 02:36:14.000000', "address" = 'kkkkkkkkkkkkk' WHERE "orders"."id" = 212

   def destroyOneOrder
    @order = Order.find(params[:id])
    @order.destroy
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 228 LIMIT 1
DELETE FROM "orders" WHERE "orders"."id" = 228