app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY title, created_at desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
    @products = Product.paginate :page=>params[:page], :order=>'created_at desc',:per_page =>5

SELECT "products".* FROM "products" WHERE "products"."id" = 3 ORDER BY title LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "comments".* FROM "comments" WHERE (product_id = 8) ORDER BY created_at asc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "comments" WHERE (product_id = 8)
---
  def show
    @product = Product.find(params[:id])
    if session[:user_id]
      @user = User.find(session[:user_id])
    end
    @comments =Comment.paginate :page=>params[:page],:conditions => "product_id = #{@product.id}",:order=>'created_at asc',:per_page =>2

INSERT INTO "products" ("price", "image_url", "description", "updated_at", "author", "title", "sales", "created_at", "inventory") VALUES (49.9, '/uploads/20110816172222_daozhang.JPG', 'a book about meizi qiang', '2011-08-16 09:22:22.640625', 'daiyuqiang', 'mei', 0, '2011-08-16 09:22:22.640625', 3)
---
  def create
    # @product = Product.new(params[:product])
      # if request.get?
      @product = Product.new(params[:product])

      @filename = save_file
      if @filename != nil
          @product.image_url = "/uploads/#{@filename}"
      else
          @product.image_url = "/images/logo.png"
      end
    # else
      # @product = Product.new(params[:product])
    # end


    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = 8 ORDER BY title LIMIT 1
UPDATE "products" SET "updated_at" = '2011-08-01 08:36:53.968750', "image_url" = 'lorem.jpg', "description" = 'Wibble are fun!', "title" = 'Lorem Ipsum', "price" = 19.95 WHERE "products"."id" = 980190962
---
  def update
    @product = Product.find(params[:id])
    @filename = save_file
     if @filename != nil
        @product.image_url = "/uploads/#{@filename}"
     end

     respond_to do |format|
      if @product.update_attributes(params[:product])