app/controllers/users_controller.rb

INSERT INTO "users" ("user_type", "created_at", "name", "updated_at", "salt", "hashed_password") VALUES (1, '2011-08-08 07:34:47.296875', 'qinjinghui', '2011-08-08 07:34:47.296875', '377313240.898299207923433', '6e8b67af11cb0c8357e7454bc9ee126352e19c06f04550ba917a650427109762')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-08-02 03:01:27.861271', "hashed_password" = 'fab6b46f29bdd3a2f7385789823f3db44e55c9a20748f2ba04c3d8268f6ca234', "name" = 'Sam', "salt" = '430381920.0373652258829562' WHERE "users"."id" = 980190962
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
DELETE FROM "users" WHERE "users"."id" = 1
---
  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy

INSERT INTO "users" ("hashed_password", "user_type", "updated_at", "created_at", "salt", "name") VALUES ('dc74b39491639bba659f8c725323156e8970a8d2b8629f3d235c4449e72239e9', 2, '2011-08-08 07:50:53.671875', '2011-08-08 07:50:53.671875', '375275040.234052519212353', 'daiyuqiang')
---
  def createuser
    @user = User.new(params[:user])
    @user.user_type = 2

    respond_to do |format|
      if @user.save