app/views/products/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
		<fieldset style="background-color:#bfb">
			<% @user = User.find(comment.user_id)%>